{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Reshape", "config": {"target_shape": [2500], "batch_input_shape": [null, 2500], "trainable": true, "name": "reshape_1", "input_dtype": "float32"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 64}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 128}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Reshape", "config": {"target_shape": [1, 128], "trainable": true, "name": "reshape_2"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_1", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "glorot_uniform", "bias": true, "nb_filter": 64, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_2", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "glorot_uniform", "bias": true, "nb_filter": 32, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_3", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "glorot_uniform", "bias": true, "nb_filter": 64, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_4", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "glorot_uniform", "bias": true, "nb_filter": 5, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": null}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_6"}}, {"class_name": "Reshape", "config": {"target_shape": [5], "trainable": true, "name": "reshape_3"}}]}